{"id": 72319191, "location": "petaling", "company": "netmedias leashares sdn. bhd.", "job_title": "data analyst", "salary": "RM 3,500 – RM 4,000 per month", "description": "Looking for an opportunity to work in international markets?\nLooking for a company to unleash your potential and ability?\nLooking for a place that recognize your work performance?\nYou are a self-drive person.\nProactive, result-oriented and positive mindset.\nFree parking\nMeal allowance.\n5 minutes walking distance to MRT station (Phileo Damansara).\nTo interpret data, analyse the results by using statistical techniques and provide ongoing statistical reports.\nTo develop and implement databases, data analytics and collection systems, and other strategies that optimize statistical data quality.\nTo acquire data from primary or secondary data sources which includes collecting data from various sources such as internal databases, external, surveys, market research reports, and other relevant sources and maintain databases/data systems.\nTo identify, analyse, and interpret data trends or patterns in complex data sets which ensure the data accuracy, completeness, and consistency.\nTo filter and “clean” data by reviewing computer reports, printouts, and performance indicators to locate and correct code problems\nTo work with management to prioritize business and information needs.\nTo stay updated with industry trends and best practices in data analysis and reporting.\nCandidate must possess at least bachelor's degree in Statistics, Mathematics, Computer Science, or its equivalent.\nProven experience as a Data Analyst or in a related field.\nTechnical expertise regarding data models, database design development, data mining, and segmentation techniques.\nStrong in analytical skills with the ability to collect, organize, analyse, and disseminate significant amounts of information with attention to details and accuracy.\nFresh graduates are welcomed to apply.\nWhich of the following web analytics tools are you experienced with?"}