{"id": 72339429, "location": "shah alam/subang", "company": "zuspresso (m) sdn bhd", "job_title": "data engineer", "salary": "RM 8,000 – RM 12,000 per month", "description": "Design and Develop Data Pipelines: Create and maintain efficient, reliable, and scalable data pipelines that extract, transform, and load (ETL) data from diverse sources into AWS data storage systems.\nData Modeling and Architecture: Design and implement data models for data warehousing and data lakes on AWS, ensuring data integrity, performance, and scalability.\nAWS Cloud Infrastructure: Utilize various AWS services such as Amazon S3, Amazon Redshift, AWS Glue, Amazon EMR, Amazon RDS, and others to build data solutions.\nData Transformation and Processing: Develop data transformation processes, including data cleansing, enrichment, and aggregation, to ensure data accuracy and consistency.\nPerformance Optimization: Identify and implement performance optimization techniques to enhance data processing speed and reduce latency in data pipelines.\nData Security and Compliance: Ensure that data handling practices comply with relevant data security and privacy regulations. Implement security measures to protect sensitive data.\nMonitoring and Troubleshooting: Monitor data pipelines, data jobs, and data storage systems for issues and troubleshoot any data-related problems to ensure smooth data flow.\nDocumentation: Create and maintain technical documentation for data engineering processes, data models, and data pipelines.\nCollaboration and Communication: Work closely with data scientists, analysts, and other stakeholders to understand data requirements and deliver data solutions that meet business needs.\nContinuous Improvement: Stay updated with the latest AWS services and data engineering best practices to propose and implement improvements to the existing data infrastructure.\nBachelor's degree in Computer Science, Engineering, or a related field. A Master's degree is a plus.\nProven experience as a Data Engineer/Architect for at least 3 years, specifically working with AWS data services and related technologies.\nStrong knowledge of AWS services such as Amazon S3, Amazon Redshift, AWS Glue, Amazon EMR, Amazon RDS, and others.\nProficiency in programming languages such as Python, SQL, and familiarity with data manipulation frameworks/libraries.\nHands-on experience with data modeling, data warehousing concepts, and building data pipelines using ETL tools.\nFamiliarity with data governance, data security, and data privacy best practices.\nExcellent problem-solving skills and the ability to work independently as well as part of a team.\nStrong communication skills to effectively collaborate with cross-functional teams and convey technical concepts to non-technical stakeholders.\nExcellent problem-solving skills and the ability to work independently as well as part of a team.\nStrong communication skills to effectively collaborate with cross-functional teams and convey technical concepts to non-technical stakeholders.\nAWS Certified Data Analytics - Specialty or similar certifications.\nExperience with server less computing, containerization, and microservices architecture on AWS.\nKnowledge of data streaming platforms and technologies such as Apache Kafka or Amazon Kinesis.\nExperience in handling unstructured data and NoSQL databases on AWS.\nFamiliarity with machine learning concepts and applying machine learning models to data processing tasks.\n \nHow many years' experience do you have as a Data Engineer?\nWhich of the following programming languages are you experienced in?"}