{"id": 72412325, "location": "shah alam/subang", "company": "monkeycloud media sdn. bhd.", "job_title": "junior data analyst", "salary": "RM 3,000 – RM 4,000 per month", "description": "Collect and compile data from different sources, including databases, and spreadsheets.\nFiltering and cleaning data to ensure accuracy.\nAnalyze data to identify trends, patterns, and anomalies, and provide actionable insights to support in various team decision-making.\nDevelop and maintain dashboards and reports to track key project performance metrics, including progress and target achievement.\nConduct ad-hoc data analysis to address specific project management questions or issues.\nAssist in the preparation of presentations and reports for project status updates and executive-level reporting.\nDiploma or Degree in any related field\nExperience in data analysis, business analysis or similar role, with a strong focus on data manipulation and analysis is preferred.\nFamiliarity with data analysis tools and concepts, with experience in Power BI being a strong advantage.\n2-3 years working experience as a Business Intelligence Analyst/Data Analyst or any position that related to data and business analytics with strong statistical background.\nPreferably with prior experience in the FMCG industry.\nExperience in data analysis, business analysis or similar role, with a strong focus on data manipulation and analysis is preferred.\nProficiency in data analysis tools and software, such as Power BI, Microsoft Excel (Pivot, Macro) or similar tools.\nStrong organizational skills and the ability to manage multiple tasks and priorities simultaneously.\nA collaborative and team-oriented mindset with the ability to work effectively in a cross-functional environment.\nExcellent communication and presentation skills, with the ability to convey complex information clearly and effectively.\nStrong analytical and problem-solving skills, with the ability to translate data into actionable insights.\nHow many years' experience do you have as a data analyst?\nHow many years' experience do you have as a Power BI Consultant?\nHow would you rate your Mandarin language skills?\nWhich of the following data analytics tools are you experienced with?"}