{"id": 72429876, "location": "shah alam/subang", "company": "pwm (pet world international sdn bhd)", "job_title": "data analyst", "salary": "RM 4,500 – RM 6,000 per month", "description": "Analyze & identify trends across the online customer journey, providing insight & recommendations to drive additional traffic & sales over eCommerce platforms\nUtilize multiple data sources and turn different data streams into a cohesive view of our customer to produce detailed digital business insights & analysis\nEnsure the tracking of A/B & MV testing scenarios in partnership with the eCommerce Coordinator\nContinuously track and optimize online acquisition campaigns in partnership with the Acquisition Coordinator\nEnsure all eBusiness activities & KPIs are tracked and aligned with CRM team\nProvide detailed analysis of path to registration and path to purchase to improve conversion funnel\nProvide detailed analysis of merchandizing zones performance to refine understanding of winning combinations (menu/pages/section/placement/creative)\nDeliver reports dashboards to monitor the digital performance of the eChannel\nSetup & maintain daily eCommerce KPI reports\nProduce Monthly/Quarterly/Annual eBusiness KPI dashboards with associated insights\nAnalyses & identify trends cross channels and deliver reports to monitor the performance\nProduce regular reporting and periodic research from both offline and online channels\nDefine & Identify opportunities between cross-channels\nProduce Monthly/Quarterly/Annual finding with associated insights\nMaintain & adjust the forecasting based on actual results & key learnings throughout the year\nPossess at least a Bachelor’s degree or equivalent\nAt least 2 years of experience with web/mobile analytics, metrics gathering, reporting and analysis;\nExperience with eCommerce analytics, experience with Google Analytics is a must;\nProficient with PowerPoint to build impactful presentation.\nAdvanced proficiency with Excel, including ability to generate complex data and analysis to provide recommendation;\nApply expertise in quantitative and qualitative analysis to generate presentation with actionable insight and recommendation leveraging Customer data, Site-centric data, BI data and any relevant contextual data\nBackground and knowledge of E-commerce and online Marketplace Management\nWhat's your expected monthly basic salary?\nHow many years' experience do you have as a data analyst?\nWhich of the following programming languages are you experienced in?\nWhich of the following web analytics tools are you experienced with?\nHave you worked in a role which requires a sound understanding of the software development lifecycle?"}