{"id": 72540519, "location": "petaling", "company": "global parcel service (m) sdn bhd", "job_title": "data analyst", "salary": "RM 3,500 – RM 5,000 per month", "description": "Growth opportunities\nInternational vision\nPromising career development\n Develop and automate dashboards, analyses, and reports to support business functions. \n Collaborate with stakeholders in Operations and Sales to make data-driven decisions. \n Create pipelines and queries in the data warehouse. Maintain the integrity of the data as the \"single source of truth\"\nCoding skills: Basic knowledge of programming languages such as Stata, SQL, R studio, C++ , for logistics jobs that involve data analysis, automation, and optimization.\nData analysis skills: The ability to analyze large datasets, identify patterns, and extract insights is essential for logistics jobs that involve forecasting, planning, and decision-making.\nCommunication skills: Logistics professionals need to communicate effectively with team members to ensure that results are delivered in a timely manner.\nProblem-solving skills: Logistics professionals need to be able to identify and solve problems quickly and efficiently to minimize delays.\nAttention to detail: Logistics professionals need to be detail-oriented to ensure that shipments are accurate, complete, and compliant with regulations.\nCandidates with prior work experience in relevant fields are preferred.\nExcellent communication and interpersonal skills.\nAble to work well with cross-functional teams.\nStrong problem-solving skills.\nWhich of the following statements best describes your right to work in Malaysia?\nWhat's your expected monthly basic salary?\nHow many years' experience do you have as a data analyst?\nWhich of the following Microsoft Office products are you experienced with?\nHow would you rate your English language skills?\nWhich of the following languages are you fluent in?\nAre you willing to undergo a pre-employment background check?\nHow much notice are you required to give your current employer?"}