{"id": 72662959, "location": "penang island", "company": "analog devices sdn. bhd.", "job_title": "principal engineer, automation project", "salary": "RM 12,000 – RM 17,000 per month", "description": "Develop and execute a comprehensive automation strategy that aligns with the organization's overall manufacturing objectives and Industrial 4.0 principles.\nLead the implementation and integration of automation technologies, including robotics, artificial intelligence, machine learning, and IoT devices, into the manufacturing processes.\nCollaborate with cross-functional teams, including engineering, operations, and IT, to identify automation opportunities, define project scopes, and establish implementation plans.\nEvaluate and select appropriate automation solutions, ensuring compatibility with existing systems and equipment.\nOversee the installation, configuration, and troubleshooting of automation equipment, ensuring optimal performance and minimal downtime.\nEstablish and maintain connectivity between equipment and the manufacturing system, enabling real-time monitoring, data collection, and analysis.\nDevelop and implement data automation strategies to streamline production workflows, enhance operational efficiency, and drive data-driven decision-making processes.\nImplement error-proofing measures, such as vision systems, sensors, and quality control checks, to minimize manufacturing errors and improve product quality.\nIdentify and analyze productivity bottlenecks in the manufacturing process, and propose and implement automation solutions to optimize throughput and reduce cycle times.\nEnsure compliance with industry standards, regulations, and best practices related to automation, data privacy, and cybersecurity.\nTrain and mentor manufacturing personnel on the operation and maintenance of automation systems, fostering a culture of continuous learning and improvement.\nStay updated with the latest advancements and trends in manufacturing automation, Industrial 4.0, and related technologies, and provide recommendations for continuous improvement.\nBachelor's Degree in Engineering, Computer Science, or a related field. Advanced Degree preferred.\nProven experience in manufacturing automation, process optimization, and Industrial 4.0 implementation.\nStrong knowledge of automation technologies, including robotics, artificial intelligence, machine learning, and IoT devices.\nFamiliarity with connectivity protocols and standards such as OPC-UA, MQTT, and RESTful APIs.\nExperience in data automation, data analytics, and visualization tools.\nProficient in programming languages, such as Python, C++, or Java, for automation system integration and customization.\nDemonstrated project management skills, including the ability to lead cross-functional teams, manage timelines, and deliver results within budget.\nExcellent problem-solving and analytical abilities, with a strong attention to detail.\nStrong communication and interpersonal skills to effectively collaborate with stakeholders at all levels of the organization.\nKnowledge of manufacturing processes and a deep understanding of the interplay between automation, error-proofing, and productivity improvement."}