{"id": 72700478, "location": "kuala lumpur", "company": "ambition group malaysia sdn bhd", "job_title": "rpa manager (uipath)", "salary": "RM 7,000 – RM 10,000 per month", "description": "Develop and execute a comprehensive UiPath automation strategy aligned with organizational goals.\nCollaborate with stakeholders to identify automation opportunities and prioritize projects for implementation.\nLead a team of UiPath developers and analysts, providing guidance, mentorship, and fostering a collaborative and innovative work environment.\nOversee the end-to-end development lifecycle of UiPath automation projects.\nDesign, develop, and implement UiPath automation solutions to streamline business processes.\nEnsure the quality, scalability, and robustness of developed automation workflows.\nAnalyze existing business processes to identify areas for improvement and automation.\nWork closely with business units to optimize processes for maximum efficiency and productivity.\nLead the deployment of UiPath automation solutions, ensuring seamless integration with existing systems.\nProvide ongoing maintenance, support, and troubleshooting for deployed automation workflows.\nConduct training sessions for end-users and stakeholders on UiPath best practices and functionality.\nCreate and maintain comprehensive documentation for all UiPath processes and workflows.\nBachelor's degree in Computer Science, Information Technology, or a related field.\nProven experience as a UiPath Developer with a minimum of 3 years in a managerial or leadership role.\nIn-depth knowledge of UiPath Studio, Orchestrator, and other UiPath products.\nStrong programming skills, particularly in .NET.\nProficiency in implementing and managing UiPath automation solutions.\nDemonstrated ability to lead and inspire a team of UiPath developers.\nStrong project management and organizational skills.\nExcellent communication and interpersonal skills.\nAbility to effectively convey technical information to non-technical stakeholders.\nProven problem-solving skills with a strategic and analytical mindset.\nAbility to troubleshoot and resolve complex issues related to UiPath implementations.\nUiPath Advanced Developer certification is highly desirable."}