{"id": 72733305, "location": "kuala lumpur", "company": "snsoft sdn. bhd.", "job_title": "database administrator", "salary": "RM 8,500 – RM 12,000 per month", "description": "13th Months Salary (upon Company Declaration)\nProject Incentive (upon Company Declaration based on project performance)\nTransport, Meal, Birthday Allowances (upon Confirmation)\nMedical + Dental claim\nSports Activities (Badminton & Basketball),\nTeam Building activities\nTraining and certification sponsored by company (Selected employees).\nRewards and recognition: Long Service Award / Best Performer Award / Role Model Awards etc\nSmart casual attire\nYearly annual dinner\nDesigns and plans database structural architecture, requirements by analyzing and reviewing client operations, applications, and programming; evaluate current systems;\nBuild/Configure various types of databases such as Mongo, MySQL and Redis database replication based on business development trends\nEvaluate, plan and perform the DB upgrades, back-up, recovery and data migration\nDesign and implement Disaster Recovery plans & High Availability solutions and recommendations based on different types of databases\nSetup and maintain Linux based systems used for the database.\nSetup and manage on cloud AWS services and databases. \nTo be responsible perform daily database related tasks such as:\nCreate, publish and monitor database health checks to monitoring systems to identify slow queries; replication lags; node failures; index usage patterns; CPU usage; memory usage; locks; number of connections and any other relevant parameters\nDrive best practices for backups, replication, and health checks\nWork closely with the application team to understand what changes are coming in a build/patch/hotfix, do an impact analysis, fine-tune the queries if any\nAutomate the database repetitive tasks\nTo assess database implementation procedures to ensure they comply with internal and external regulations.\nCandidates must possess at least a Bachelor's Degree/Post-Graduate Diploma/Professional Degree in Computer Science/Information Technology or equivalent.\nAt least 2 years hands-on experience as database administrator in production environments.\nPreferably candidates who are proficient/familiar with MySQL/ MONGODB database operating mechanism/architecture, including performance optimization and adjustment.\nProficiency in writing debugging procedures, functions and SQL statements.\nStrong scripting experience in Unix/Shell Scripting and Python.\nCandidate who is experienced in AWS is a plus point.\nPreferably candidates with strong troubleshooting skills, have good technical sense and ability in document integration.\nPreferably candidates who are eager to learn new technology.\nPrefer candidates who can speak basic mandarin.\nWhich of the following Relational Database Management Systems (RDBMS) are you experienced with?\nWhat's your expected monthly basic salary?\nWhich of the following languages are you fluent in?\nWhich of the following programming languages are you experienced in?\nHow would you rate your Mandarin language skills?\nHow many years' experience do you have as a Database Administrator?\nDo you have customer service experience?\nWhich of the following Linux distributions are you familiar with?"}