{"id": 72787241, "location": "shah alam/subang", "company": "accordia global sdn bhd", "job_title": "machine learning engineer (ai)", "salary": "RM 5,000 – RM 7,000 per month", "description": "Design, develop, and deploy machine learning models for our AI assistants\nWork with data scientists and engineers to build and maintain our data pipelines and infrastructure\nEvaluate and improve the performance of our AI assistants\nCollaborate with product managers and designers to ensure that our AI assistants meet the needs of our customers\nCollaborate with a multi-functional agile team of data science, UX / UI design, product management, and engineering to build new features / products / services that delight our customers.\nDevelop and create end-to-end machine learning feedback loop and integrate it into various customer interaction applications.\nImprove existing machine learning models both in terms of model performance and computing performance.\nHelp drive code review, optimization, testing, and tooling to improve code quality and system reliability.\nResearch and implement best practices to enhance existing machine learning infrastructure and process.\nBe part of an active group of data science and machine learning practitioners that shape the direction of machine learning and artificial intelligence of the organization.\nBS or higher in Computer Science, Computer Engineering or related technical fields involving Machine Learning or equivalent technical experience\nStrong analytical and problem-solving skills - Proven software development skills in multiple programming languages (e.g., Python, Golang, C, React, Angular)\nExperience with machine learning software packages (e.g., ChatGPT, Keras, scikit-learn, XGBoost, TensorFlow, NLTK, Caffe, Theano)\nConversational platforms such as Rasa and Nuance Mix\nFamiliar with LLM Model such as Chatgpt or Google's Bard\nFamiliarity with container-based technologies (e.g., Docker, Kubernetes) and DevOps practices (e.g., code review, automated testing, CI / CD, logging, performance monitoring)\nFront-end technologies such as React and React Native (Nice to have)\nFamiliar with Relational, NoSQL & Vector databases (MySQL, MongoDB, Weaviate, etc)\nStrong communication skills & collaborative mindset\nExperience with data processing tools (e.g., Hadoop, Apache Spark, Apache Beam) and Cloud platforms (e.g., AWS, Azure, GCP) considered a plus\nCompetitive salary and benefits package\nOpportunity to work on challenging and innovative projects\nCollaborative and supportive work environment\nOpportunities for professional development and growth\nWe are a team of passionate and innovative engineers who are committed to building the best possible AI assistants for our customers.\nWe offer a collaborative and supportive work environment where everyone is valued and respected.\nWe are committed to professional development and growth, and we offer our employees opportunities to learn and grow their skills.\nWe offer a competitive salary and benefits package.\nIf you are a talented and passionate Machine Learning Engineer who is looking for a challenging and rewarding opportunity, we encourage you to apply!\nHave you worked in a role which requires experience with machine learning?\nWhat's your expected monthly basic salary?\nHow many years' experience do you have as a Machine Learning Engineer?"}