{"id": 72863386, "location": "kuala lumpur", "company": "ag staffing malaysia", "job_title": "data analysts/ data engineers (bangsar south- kerinchi lrt)", "salary": "RM 8,000 – RM 12,000 per month", "description": "Data Collection and Analysis: Collaborate with cross-functional teams to gather and analyze game-related data, including player behaviour, in-game transactions, and performance metrics.\nData Visualization: Create insightful and easy-to-understand data visualizations, dashboards, and reports to communicate key findings to stakeholders.\nPlayer Insights: Identify trends and patterns in player behaviour, demographics, and preferences to enhance player experiences and engagement.\nA/B Testing: Design and execute A/B tests to evaluate the impact of game updates and features on player engagement and monetization.\nPerformance Optimization: Work closely with game developers to optimize game performance, identify bottlenecks, and recommend improvements.\nPredictive Analytics: Utilize statistical and machine learning techniques to build predictive models for player churn, spending patterns, and other relevant metrics.\nData Quality Assurance: Ensure data accuracy and integrity by implementing data validation processes and quality checks.\nFresh graduates are encouraged to apply \nBachelor's degree in a relevant field (e.g., Data Science, Statistics, Computer Science, or a related discipline). Advanced degree preferred.\nProven experience in data analysis, preferably in the gaming industry.\nProficiency in data analysis tools such as SQL, Python, or R.\nStrong data visualization skills using tools like Tableau, Power BI, or similar.\nFamiliarity with statistical analysis and A/B testing methodologies.\nExcellent communication skills with the ability to present complex data findings to both technical and non-technical stakeholders.\nSelf-motivated, detail-oriented, and able to work independently as well as part of a team.\nPassion for gaming and a deep understanding of gaming mechanics and player behaviour is a plus.\nData Pipeline Development: Design, build, and maintain scalable and efficient data pipelines to collect, process, and store game-related data from various sources.\nData Architecture: Collaborate with data analysts and data scientists to design and optimize data models and schema for analytical and reporting needs.\nETL Processes: Develop and implement ETL processes for transforming raw data into structured datasets, ensuring data accuracy and integrity.\nPerformance Optimization: Monitor and optimize data pipelines for performance, reliability, and cost-effectiveness.\nData Quality Assurance: Implement data validation, data quality checks, and error handling to ensure data consistency and accuracy.\nDatabase Management: Administer and manage data storage systems, including data warehouses and data lakes.\nDocumentation: Maintain clear and comprehensive documentation for data pipelines, processes, and architectural decisions.\nBachelor's degree in Computer Science, Data Engineering, or a related field. Advanced degree preferred.\nProven experience as a data engineer with expertise in data pipeline development, ETL processes, and data architecture.\nProficiency in programming languages such as Python, Java, or Scala.\nStrong knowledge of data modeling, database management, and SQL.\nExperience with big data technologies and frameworks, such as Hadoop, Spark, or Flink.\nFamiliarity with cloud platforms like AWS, Azure, or Google Cloud.\nExcellent problem-solving skills and the ability to work collaboratively in a team.\nPassion for gaming and a deep understanding of gaming data is a plus.\n13th Months Salary (upon Company Declaration)\nProject Incentive (upon Company Declaration based on project performance)\nTransport, Meal, Birthday Allowances (upon Confirmation)\nSports Activities (Badminton & Basketball), Company Outing\nTraining and certification sponsored by company (Selected employees).\nRewards and recognition: Long Service Award / Best Performer Award / Role Model Awards etc\nWhat's your expected monthly basic salary?"}