{"id": 74323540, "location": "petaling", "company": "agensi pekerjaan lewis talent consulting sdn. bhd.", "job_title": "data scientist", "salary": "RM 6,000 – RM 8,500 per month", "description": "Understanding the data information, investigating and preprocessing vast datasets to unveil significant features and insights.\nDesign and deploy predictive models employing advanced statistical and machine learning techniques to address complex business issues.\nGenerate compelling visualizations to illustrate complex analyses and insights to both technical and non-technical audiences.\nEngage closely with multidisciplinary teams to grasp business objectives and partake in data-driven projects.\nKeep abreast of the latest data science advancements and enhance the organization's data science methodologies.\nAt least possess a Master's or Ph.D. in Data Science, Statistics, Computer Science, or related fields.\nDemonstrated experience as a Data Scientist, supported by a portfolio of successful data science projects.\nExpertise in Python or R, including familiarity with relevant libraries and frameworks.\nSolid foundation and experience in applying machine learning algorithms to practical problems.\nStrong interpersonal and communication capabilities for effective teamwork with cross-functional groups.\nCommitment to staying informed about industry trends, data science techniques, and tools. Engage in ongoing training and development programs as necessary.\nExpertise in analyzing extensive, complex datasets to extract valuable insights.\nProficiency in applying statistical and machine learning methods to solve real-world challenges.\nCompetence in programming languages like Python or R for data analysis and modeling.\nStrong ability in creating visualizations with tools such as Tableau, Power BI, or similar platforms.\nCreative problem-solving aptitude for tackling complex business issues with data-driven solutions.\nExceptional ability to articulate complex findings and insights clearly.\nHow many years' experience do you have as a data scientist?\nWhich of the following programming languages are you experienced in?\nWhich of the following data analytics tools are you experienced with?\nHow would you rate your Mandarin language skills?\nWhich of the following languages are you fluent in?"}