{"id": 74324430, "location": "petaling", "company": "agensi pekerjaan lewis talent consulting sdn. bhd.", "job_title": "data scientist assistant manager", "salary": "RM 10,000 – RM 14,000 per month", "description": "Support the oversight of data science projects to ensure their timely and precise execution, delivering advanced analytics and insights. Address project hurdles collaboratively and refine project outcomes.\nAssist the Data Scientist Manager in mentoring and directing the data science team. Offer guidance on project priorities, technical challenges, and career growth.\nEngage with your team to craft and execute predictive models leveraging sophisticated statistical and machine learning techniques to tackle complex business issues.\nAid in the exploration and preprocessing of large datasets to unearth valuable features and insights.\nCollaborate effectively with multidisciplinary teams to grasp business goals, align data science projects, and articulate insights to non-technical audiences.\nDrive the enhancement of data science methodologies and processes. Keep abreast of industry standards and evolving trends.\nHolding a minimum of Master's or Ph.D. in Data Science, Statistics, Computer Science, or any other related fields.\nDemonstrable experience as a Data Scientist, including roles in leadership or management.\nHigh proficiency in languages such as Python or R, along with familiarity with pertinent libraries and frameworks.\nA thorough grasp and application experience of machine learning algorithms in practical scenarios.\nExcellent interpersonal and communication skills for effective teamwork and cross-functional collaboration.\nA commitment to continuous learning, staying updated with data science trends, techniques, and tools, and participating in relevant training and development programs.\nProven leadership ability to mentor and inspire a team of data scientists.\nExceptional project management capabilities, with a knack for prioritizing, resource allocation, and deadline adherence.\nSkilled in dissecting large, intricate datasets to extract significant insights.\nProficiency in utilizing advanced statistical and machine learning methods to address real-world challenges.\nCompetent in programming languages like Python or R for data analysis and modeling.\nStrong communication skills, capable of explaining complex findings to a broad audience range.\nHow many years' experience do you have as an Assistant Manager?\nWhich of the following programming languages are you experienced in?\nWhich of the following data analytics tools are you experienced with?\nWhich of the following languages are you fluent in?\nHow would you rate your Mandarin language skills?"}