{"id": 74323206, "location": "petaling", "company": "agensi pekerjaan lewis talent consulting sdn. bhd.", "job_title": "senior data analyst", "salary": "RM 5,000 – RM 7,000 per month", "description": "Lead sophisticated ETL processes to aggregate data from various sources into our data warehouse.\nPerform comprehensive data analysis to uncover trends, patterns, and insights, aiding in addressing business challenges and uncovering opportunities.\nPioneer the development of complex data visualizations, charts, and dashboards with tools like Tableau and Power BI.\nEnsure data integrity through rigorous quality control, identifying and correcting discrepancies.\nWork closely with different departments to align data insights with business objectives, advising on strategic actions.\nMentor junior data analysts, promoting a culture of continuous learning and professional growth.\nAt least possess a Bachelor’s or Master’s in Data Science, Mathematics, Statistics, Computer Science, or any equivalent fields.\nTechnical Proficiency in data analysis (Excel, Python, SQL) and visualization tools (Tableau, Power BI) are required.\nSignificant experience in a senior data analyst capacity, evidenced by impactful contributions.\nA solid understanding of Machine Learning, AI, and Data Warehousing principles.\nLeadership Experience: Demonstrated ability to lead and develop a team of data analysts.\nExceptional analytical skills for dissecting complex datasets and performing advanced statistical analyses to derive actionable insights.\nDemonstrated leadership with the capability to effectively collaborate with both technical and non-technical teams.\nCreative problem-solving skills, offering innovative solutions to business issues.\nExcellent communication, able to simplify complex data findings for a varied audience.\nHow many years' experience do you have using SQL queries?\nHow would you rate your Mandarin language skills?\nWhich of the following languages are you fluent in?\nWhich of the following data visualisation tools are you experienced with?\nWhich of the following data analytics tools are you experienced with?"}