{"id": 74354434, "location": "petaling", "company": "emart24 holdings sdn. bhd.", "job_title": "data analyst", "salary": "RM 6,800 – RM 7,000 per month", "description": "Develop and maintain dashboards and reports that provide insights into key performance indicators (KPIs) across all business functions.\nPartner with IT team to leverage technology infrastructure and tools to optimize data collection, storage, and analysis processes.\nConduct ad-hoc analysis to answer business questions and identify opportunities for growth and improvement.\nCollaborate with cross-functional teams to identify, analyze and recommend data driven solutions to business problems.\nDevelop and maintain data pipelines to ensure data is accurate, consistent, and available in a timely manner.\nIdentify and recommend BI tools that can help to improve data visibility and analysis across the organization.\nTrain and support end-users on the use of BI tools and dashboards.\nProvide recommendations to stakeholders on how to use data to drive growth and improve bottom-line results.\nContinuously monitor the performance of the business and make recommendations for improvement based on data analysis.\nMaintain a high level of data quality, accuracy, and consistency.\nBachelor's degree in Actuarial Science, Computer Science, Information Technology, or a related field.\nProven experience (3-5 years) in a business intelligence or data analyst role, preferably in a retail or eCommerce environment.\nExperience using BI tools such as Power BI, Tableau, Metabase, or Google Data Studio.\nProficient in SQL and/or Python, and data visualization tools.\nStrong analytical and problem-solving skills with the ability to work with complex data sets.\nAbility to work collaboratively and communicate effectively with cross-functional teams.\nKnowledge of retail or eCommerce industry and data trends.\nExcellent communication skills, both written and verbal, with the ability to communicate complex ideas in a simple and clear manner.\nAbility to prioritize and manage multiple projects simultaneously.\nProficient in both English and Bahasa Malaysia.\nWhich of the following statements best describes your right to work in Malaysia?\nWhat's your expected monthly basic salary?\nHow many years' experience do you have as a data analyst?\nWhich of the following programming languages are you experienced in?\nHow many years' experience do you have using SQL queries?\nWhich of the following Relational Database Management Systems (RDBMS) are you experienced with?\nHow would you rate your English language skills?\nWhich of the following languages are you fluent in?"}