{"id": 74354364, "location": "kuala lumpur", "company": "persolkelly workforce solutions malaysia sdn bhd", "job_title": "data analyst", "salary": "RM 5,500 – RM 6,500 per month", "description": "Provide quantitative analytics support to the AML Transformation & Governance team to enhance risk assessment of ongoing current and emerging AML centric risks in core areas; business, client, operations & system controls within the international business entities. \nDevelop and enhance quantitative/qualitative risk assessment model to proactively identify risks enhancement opportunities in areas that are not clearly defined by legislative AML guidance \nProvide data extraction & quantitative validation for targeted AML risks or ongoing AML issues identified \nProvide other ad hoc data extraction and validation requests from time to time and assist in the maintenance of data library for all IBG entities \nProvide periodic quantitative entities’ risk assessment report as part of AML governance update to the AML IBG management \nProvide collaboration support with the AML data team on entity level business intelligence related request from regional AML teams. \nBachelor degree or above majoring in computer science/engineering, statistics, Mathematics, finance and similar fields; Candidate with experience in AML risk modelling and data analytics are preferred \nAt least three years' AML/risk control/fraud management working experience in FI, PI, consulting firms or similar industries \nProficient in data handling coding (e.g., SQL) and at least one professional analytics tool such as SAS, python etc. \nFamiliar with at least one popular BI tool, such as Power BI, Tableau.\nStrong ability in logical thinking and problem solving \nAble to plan & work independently on required deliverables and deadlines \nAble to work under pressure and result-oriented \nHighly flexible and detail-oriented with the ability to multi-task and change directions based on demand\nHow many years' experience do you have as a data analyst?\nWhich of the following languages are you fluent in?\nHow many years' experience do you have as a business intelligence (BI) analyst?"}