{"id": 74434092, "location": "petaling", "company": "michael page international (malaysia) sdn bhd", "job_title": "data analyst - internal audit", "salary": "$102k - $103k p.a.", "description": "Gain understanding of the company's financial, commercial and operational processes.\nPerform a hybrid role of conducting risk-based financial and operational audits with a core function of data analytics and statistical analysis of existing data sets\nQuery and mine large data sets to discover transaction patterns, examine data and filter for targeted information\nPrepare and execute data analysis and interpret the results based on requirements to support the Express audit department and the Data Analytics team\nPrepare data reports and clear data visualizations for stakeholders\nDevelop tools, audit approach and audit programs in strong cooperation with the Express audit team to support the internal audit work\nDevelop automation for data analysis to increase audit efficiency\nPresent key insights using advanced visualization tools, and highlight the data analytics capability to the IA team globally\nPresent and discuss findings/data analysis results with management and create high quality audit reports and working papers in line with Internal Audit standards\nPerform requested follow-up procedures as necessary\nOpenness to conduct audits across various segments of the company's business, including Operations (OPS), Customs, Finance, and Commercial\nBuild and maintain solid relationships with key stakeholders, especially in the business IT area\nManage own development in the professional area proactively\nKnowledge and experience in MS Office and the following desirable applications: \nDatabase query languages (e.g. SQL)\nPower BI, Tableau, Qlik Sense, KNIME\nProgramming and coding (e.g. Python, R, C/C++/C#, Visual Basic)\nCloud computing, Azure, AWS, RPA\nProcess mining, e.g. Celonis, DISCO, Signavio\nExcellent English language skills\nConvincing communicator and negotiator\nAnalytical and conceptual abilities\nAnalytical problem solving and proactive in finding solutions\nHigh personal responsibility and high degree of integrity\nAbility to work under pressure in a demanding environment\nRapid comprehension\nWillingness to travel up to 30% of the time (or more if business needs dictate)\nDatabase query languages (e.g. SQL)\nPower BI, Tableau, Qlik Sense, KNIME\nProgramming and coding (e.g. Python, R, C/C++/C#, Visual Basic)\nCloud computing, Azure, AWS, RPA\nProcess mining, e.g. Celonis, DISCO, Signavio\nMinimum two years of experience in data analytics, preferably within the company\nMinimum bachelor's degree in information technology, computer science, engineering, business administration or comparable qualification/background\nFirst professional experience, preferably within the company\nAttractive remuneration package\nBe part of a globally recognised organisation\nEnhance your analytical skills"}