{"id": 74488251, "location": "kuala lumpur", "company": "liege solutions sdn. bhd.", "job_title": "data engineer/data cloud engineer/salesforce", "salary": "RM 8,000 – RM 12,000 per month", "description": "Develop, build, and implement Salesforce Data Cloud instances in conjunction with Salesforces (Sales/Service, Salesforce Marketing Cloud, etc.)\nDevelop, oversee, and maintain key data model, segmentation, architecture, code documentation, and technical specifications for designated workstreams.\nLead the development and physical design of solutions, guide the development team, and ensure the system's architectural integrity.\nImplement Salesforce Data Cloud, emphasizing data modelling, performance optimization, and integrations.\nFunction as a technical solution specialist within the Salesforce Data Cloud ecosystem, including components like Data streams, Unified Data Model, Transformations/Insights, Identity Resolution, Segmentations, etc. \nDrive end-to-end project execution, encompassing analysis, documentation, solution development, testing, and performance, to meet client expectations.\nIdentify technical design and data model risks, confirm their validity, and devise strategies to mitigate them.\nActively participate in technical design and data model workshops alongside Engineering Teams and business stakeholders.\nClearly translate and communicate technical requirements and solutions to the business using story-based narratives, and present strategies and recommendations to executives.\nEnsure that technical documentation is consistently updated through active participation in technical workshops.\nLead sessions to understand client needs in technical marketing and Salesforce Data Cloud requirements, and act as a crucial technical resource throughout the implementation process.\nAssess client requirements, propose effective solutions, and communicate the capabilities and limitations of Salesforce Data Cloud, Marketing Cloud Engage, Personalization, Intelligence, Sales, Service, and other relevant SF ecosystem platforms.\nOversee and coordinate testing activities, including System Integration Testing (SIT) and User Acceptance Testing (UAT), in line with the project's scope.\nManage workstreams in large-scale enterprise implementations, focusing on Salesforce Data Cloud architecture and data models.\nBachelor's Degree.\nExperience with at least 1 end-to-end Salesforce Data Cloud implementation.\nExperience with at least 1 Salesforce cross-cloud integrations.\n5+ years in data model and architecture in the Salesforce ecosystem.\n5+ years in consulting, project implementation for global based client, or project management using Agile methodologies.\n5+ years in Customer Data Modelling best practices.\nProficiency in moderately complex SQL queries, SOQL, Python.\nExperience in integrating with cloud-based data warehouses/data lakes (e.g. Snowflake, Databricks, etc.).\nEffective communication to both technical and non-technical audiences.\nExperience with Tableu, Data Analytic Platform (e.g. PowerBI).\nExperience with Segmentation strategy.\nExperience with Marketing Cloud Personalization.\nExperience with Adobe, Marketo, Oracle or other enterprise marketing automation or CDP platforms.\nFront-end coding skills (HTML, CSS/SASS, Typescript, React, XML, JSON).\nSalesforce certifications (Salesforce Data Cloud Consultant , and Salesforce Certifications - Marketing Cloud, Admin, etc.).\nA supportive, friendly and professional team environment;\nStability to develop your career with an established and growth focused company; \nA range of benefits as part of our Employee Benefit Program;\nWhich of the following statements best describes your right to work in Malaysia?\nWhat's your expected monthly basic salary?\nHow many years' experience do you have as a Salesforce Developer?\nHow many years' experience do you have as a Salesforce Architect?\nHow many years' experience do you have as a Salesforce Marketing Cloud Specialist?\nHow many years' experience do you have as a Salesforce Engineer?"}