{"id": 74552169, "location": "kuala lumpur", "company": "city facilities management sdn. bhd.", "job_title": "senior business intelligence developer / data engineer", "salary": "RM 8,000 – RM 12,000 per month", "description": "Translation of business requirements into accurate and interactive data visualizations and analytics that enable management and other stakeholders to make informed decisions.\nDrive data mining & data science initiatives\nReview reports to determine basic characteristics, such as origin and report flow, format, frequency, distribution, and purpose or function of report.\nMay prepare and issue instructions concerning generation, completion, and distribution of reports according to new or revised practices, procedures, or policies of reports management.\nExamine and evaluate purpose and content of business reports to develop new, or improve existing, format, use, and control.\nRecommend the establishment of new or modified reporting methods and procedures to improve report content and completeness of information.\nProduce associated documentation including functional specifications, testing plans and support documentation.\nUnderstand and comprehend new system changes as they affect data, reports, and reporting systems.\nConfer with team members originating, handling, processing, or receiving reports to identify problems and to gather suggestions for improvements.\nManage internal and external stakeholders.\nProvide support and coaching to application support staff and associated team members.\nProvides assistance to support existing infrastructure where appropriate..\nParticipate in application validation and QA efforts as they pertain to reporting, data, metrics, and report creation and execution.\nProvides assistance to support existing infrastructure where appropriate.\nDevelop the appropriate strategies and plans to ensure a successful implementation that conforms to the company agreed SLA’s.\nA relevant advanced technical degree.\nA mastery of Business Intelligence concepts and the ability to articulate these concepts to technical and non-technical audiences.\nAt least 5+ years’ experience in Business Intelligence\nDemonstrable strong data analysis and data mining skills (T-SQL, DAX and MDX).\nStrong data visualisation skills using SSRS & Power BI.\nExposure to Snowflake on Azure platform and Matillion tools is desirable.\nDemonstrable experience with Business Intelligence tools in the Microsoft BI stack (SSAS and SSIS) or Matillion.\nStrong communication skills with the ability to collaborate and contribute to a team positively.\nStrong analytical skills with the ability to translate business needs into technical solutions.\nThe ideal candidate will have experience working in agile projects.\nHigh cognitive ability to problem solving\nOwn and display City values, respect and value others and work as one team. (mandatory all positions)\nMaintain a professional and positive attitude at all times and act with integrity (lead by example).\nHigh level numerical and analytical skills\nDemonstrated attention to detail and accuracy\nMaintain a high standard of delivery on all work and meet deadlines\nDisplay high level of motivation and drive at all times.\nRemain calm and organised at all times.\nAbility to develop rapport to ensure effective working relationship with a broad range of managers and team members.\nDemonstrate initiative and confidentiality across the business.\nTreat others with respect and be conscientious and courteous.\nGood time management, planning and organising ability.\nWhat's your expected monthly basic salary?\n\n\nRole descriptions\n\n\nSalary insights\n\n\nTools to help you prepare for jobs\n\n"}