{"id": 74601731, "location": "kuala lumpur", "company": "air energy consulting (malaysia) sdn bhd", "job_title": "data analyst internship", "salary": "RM 900 – RM 1,000 per month", "description": "Review and update on Bullhorn data for Asia placements.\nWork with the Service Team Australia on updating the Bullhorn data for data accuracy.\nWork closely with the Quality Coordinator on the accuracy and completeness of the data (Client’s PO/WO and Contractors’ employment packages) within the Airswift systems.\nWork with the relevant parties to ensure that any errors are corrected promptly.\nAdministrator and investigate client, assignee and consultant surveys.\nData analysis – accuracy report that was generated for the entire Asia Pacific Region.\nConsolidate data and dashboards for distribution to SVPs and Global Operations as required.\nManage the Business Continuity plan and Office Safety for the super region and specific country.\nWork with other members of the Regional Commercial Team, ensuring that all requests for review, questions and queries are addressed, and escalating to the relevant people when required.\nThe entire process flow of how a manpower/workforce solution provider organisation functions (Sales/BD -> Recruitment -> Onboarding -> Payroll -> Billing).\nDiploma or Degree in Business Administration or Management or equivalent.\nKnowledge of relevant regulatory requirements in the region.\nExcellent technical skills including all Microsoft Office products and understanding of statistics.\nAbility to problem solve with high attention to detail.\nExcellent written and verbal communication and interpersonal skills.\nMust have a sense of urgency in completing tasks.\nClient service orientated with good teamwork skills.\nOwnership and willingness to accept responsibility.\nVirtual Onboarding Events.\nTeam-driven environment fostering a supportive culture with a strong emphasis on work-life balance.\nCheers! where your peers can nominate you for outstanding performance.\nCoaching and Training are provided.\nGrowth\n - In life and business, one must grow to flourish and achieve high ambitions. Growth requires change, challenge, risk and sacrifice - we will always choose growth.\nSafety\n - We create a safe and inclusive environment to protect the physical and psychological well-being of everyone we work with.\nExcellence\n - We deliver, holding ourselves accountable for results. Our customers see excellence in everything we do.\nIntegrity\n - We are ethical, open, honest and authentic. People trust us to do the right thing for the right reason.\nWhich of the following statements best describes your right to work in Malaysia?"}