{"id": 74653378, "location": "kuala selangor district", "company": "agensi pekerjaan js staffing services sdn bhd", "job_title": "data analyst (e-commerce)", "salary": "RM 4,000 – RM 4,500 per month", "description": "Analyze and interpret key indicators in e-commerce such as sales performance, SKU sales, traffic, conversion rates, buying behavior, pricing, etc. \nProvide valuable insights and identify trends based on the sales data and suggest recommendations and key action plans \nProvide competitor analysis \nEvaluation of the effectiveness of sales and marketing tools and mechanics \nCreating and developing tools for analysis and information processing \nPresenting the results of reports and graphical modeling of data \nWork closely with the E-Commerce sales team to increase sales and revenue \nDevelop and maintain data pipelines to ensure data accuracy, integrity, and availability. \nDevelop and maintain E-Commerce dashboards as per client’s requests. \nProviding insight to the E-Commerce sales team to optimize marketing expenses. \nData Review: reviewing and validating data from various sources (e.g. Lazada, Shopee, etc.) to ensure data quality and accuracy. \nCandidates must possess at least a Bachelor’s degree in Data Science, Statistics, Computer Science, or a related field \nMin. 1-2 years of experience as a Data Analyst/Business Analyst/Category Management preferably in E-Commerce or FMCG role \nAdvanced Excel and data mining skills \nProficient in data visualization tools (e.g. Power BI) and database query languages (e.g. SQL) \nKnowledge of Cloud Computing is an added advantage (e.g. Azure) \nFamiliarity with Azure Data Factory and Azure Synapse Pipelines is an added advantage \nAbility to work independently and take the lead in projects \nStrong presentation skills \nWhich of the following statements best describes your right to work in Malaysia?\nWhat's your expected monthly basic salary?"}