{"id": 74789886, "location": "petaling", "company": "oriental fortune trading malaysia sdn bhd", "job_title": "junior data analyst", "salary": "RM 3,000 – RM 4,300 per month", "description": "Data Collection and Cleaning:\n Collect and compile data from various sources, ensuring data accuracy and completeness. Perform data cleaning and transformation as necessary to prepare it for analysis.\nData Analysis:\n Assist in conducting data analysis using statistical methods, data visualization tools, and data analysis software. Summarize findings in clear and concise reports.\nData Visualization:\n Create visually appealing and informative charts, graphs, and dashboards to present data insights to stakeholders. Use tools such as Tableau, Power BI, or Excel for visualization.\nReport Generation:\n Prepare regular and ad-hoc reports to communicate key metrics and findings to the team and management. Ensure reports are accurate and delivered on time.\nData Quality Assurance:\n Help maintain data quality standards by identifying and resolving data discrepancies or inconsistencies. Collaborate with other team members to establish data quality protocols.\nCollaboration: \nWork closely with cross-functional teams to understand data requirements and deliver actionable insights.\nResearch and Learning:\n Stay up-to-date with industry trends and best practices in data analysis. Continuously expand your knowledge and skills in data analytics techniques and tools.\nBachelor's degree in a relevant field such as Finance, Data Science, Statistics, Mathematics, Computer Science, or a related discipline.\nCandidate with 1-2 years quantitative analysis or finance background are preferred; \nfresh graduates are welcome as well.\nRequired language(s): \nFluent in English & Mandarin\n are preferred because the role requires candidates to interact with Mandarin-speaking clients.\nStrong analytical skills and a passion for working with data.\nProficiency in data analysis tools and programming languages such as Excel, SQL, Python, or R.\nFamiliarity with data visualization tools (e.g., Tableau, Power BI) is a plus.\nExcellent communication skills, with the ability to translate complex data into understandable insights.\nDetail-oriented and capable of maintaining data accuracy and integrity.\nHighly organized and able to manage multiple tasks and deadlines effectively.\nTeam player with a collaborative mindset and the ability to work well in a diverse team environment.\nEagerness to learn and adapt to new tools, techniques, and technologies in the field of data analysis.\nPossess own car.\nWhat's your expected monthly basic salary?\nHow many years' experience do you have as a data analyst?\nWhich of the following languages are you fluent in?"}