{"id": 74850440, "location": "kuala lumpur", "company": "phenomenal uam sdn bhd", "job_title": "data scientist", "salary": "RM 5,000 – RM 7,500 per month", "description": "Utilizing machine learning techniques to analyze and interpret complex data sets.\nDeveloping AI models and algorithms to solve specific business problems and improve operational efficiency.\nCollaborating with engineers and software developers to integrate AI solutions into our products and services.\nConducting exploratory data analysis to identify trends, patterns, and insights.\nDesigning and implementing experiments to validate model performance and accuracy.\nCommunicating findings and insights to stakeholders through visualizations, presentations, and reports.\nStaying abreast of the latest advancements in AI and machine learning technologies, and evaluating their potential applications within our organization.\nBachelor's degree in Computer Science, Data Science, Statistics, Mathematics, or a related field. Advanced degree (Master's or Ph.D.) preferred.\nProven experience (X years) working as a Data Scientist or AI Engineer, with a strong focus on developing and implementing machine learning algorithms and AI models.\nProficiency in programming languages such as Python, R, or Java, along with experience using libraries and frameworks such as TensorFlow, PyTorch, or scikit-learn.\nSolid understanding of statistical analysis, hypothesis testing, and experimental design.\nExperience with data visualization tools such as Matplotlib, Seaborn, or Tableau.\nStrong problem-solving skills and the ability to translate business requirements into analytical solutions.\nExcellent communication and collaboration skills, with the ability to effectively convey technical concepts to both technical and non-technical stakeholders.\nFamiliarity with cloud computing platforms (e.g., AWS, Azure, Google Cloud) and big data technologies (e.g., Hadoop, Spark) is a plus.\nPassion for innovation and a keen interest in staying updated with the latest trends and advancements in AI and machine learning."}