{"id": 74946043, "location": "bandar tasik selatan", "company": "kk group of companies", "job_title": "data engineer lead", "salary": "RM 7,000 – RM 8,000 per month", "description": "Making large and/or complex data more accessible, understandable and usable\nTransforming, improving and integrating data, depending on the business requirements\nDelivering the data in a useful and appealing way to users\nWork with noisy, dirty, and unstructured data, data cleansing, scraping unstructured data, and converting into structured data\nBuild and maintain data pipelines, ETL, databases and applications to acquire, store and manage data\nChoose, design, test and implement data software and solutions for projects and enterprise\nSelecting and integrating any Big Data tools and frameworks required to provide requested capabilities\nMonitoring performance and advising necessary infrastructure changes to optimize performance and cost\nArchitect, develop and implement end-to-end automated data flows for data and analytical needs\nPerform data profiling, data quality assessment, data cleansing and data transformation\nRecommend appropriate solutions architecture that is highly scalable based on business requirement\nCreate date tools for data scientists and data visualization team members\nBuilds the infrastructure required for optimal extraction, transformation, and loading for data from a wide variety of data sources using SQL, noSQL and cloud (AWS / Azure / Google / Alibaba / DigitalOcean) technologies\nBenchmark, evaluate and improve the scalability, robustness, efficiency and performance of big data platforms and applications\nEngage in the delivery of analytics assignments for business users involving, amongst others; data preparation, data visualization, creating business insights etc\nContribute and facilitate workshops/interviews bridging the gap between data analytics and business outcomes\nProvide strategic and tactical advice to business units by translating analytical solutions into out-of-the-box execution recommendations addressing business objectives and impacting bottom line results\nCombine your technical expertise with the ability to architect, deploy and oversee integrated analytics/business intelligence/technology solutions\nBuild case for analytics through need analysis and business case (quantify likely benefits)\nConsult with leaders of business teams and manage expectations, meet project and deliverable timelines, ensure accurate and timely completion of deliverables\nCollaborate with several other teams and roles across the organization on requirements gathering and solution deployment\nMake analytical product, service or process decisions likely to impact multiple groups of employees and/or customers (internal or external)\nManage technology solution portfolios, and identifying new technology approaches to solve business problems with a strong focus on leveraging enterprise data\nContribute to the building and management of the analytics infrastructure\nWork with management team on staffing needs, strategic technology trend identification, monitoring project progress and completion, issue resolution and technical solutions related to data, data flow and advising on algorithm deployment\nCollaborate with analytics practitioners, business analysts and methodologists to design and oversee the development of working prototypes of technical solutions\nTechnical support and lead for the Data Engineer team\nWork with project teams to assist with data-related technical issues and support their data infrastructure needs\nWhat's your expected monthly basic salary?\nHow many years' experience do you have as a Data Engineer?\nHow many years' experience do you have as a Tableau Specialist?\nHow many years' experience do you have as a Power BI Developer?\nHave you completed an Amazon Web Services Developer certification?\nHave you completed a Cloudera Certified Professional Data Engineer certification?\nHow many years' experience do you have as an ETL Data Warehouse Programmer?\nHow much notice are you required to give your current employer?"}